In [19]:
import pandas as pd

In [20]:
df_info=pd.read_excel(r'C:/users/sagar/Sample.xls')
df_info

   ID   Name  Age Country
0   1    Joe   23   India
1   1   John   19     USA
2   2  James   38     USA
3   2    Kim   15      UK
4   3   Dani   20   India

In [21]:
df_info=pd.read_excel(r'C:/users/sagar/Sample.xls',index_col=0,usecols='A:D')
df_info

     Name  Age Country
ID
1     Joe   23   India
1    John   19     USA
2   James   38     USA
2     Kim   15      UK
3    Dani   20   India

In [22]:
df_Marks=pd.read_excel(r'C:/users/sagar/Sample.xls',index_col=0,sheet_name=1)
df_Marks

             Subject  Marks Result
ID
1               Math     90   Pass
1               Math     50   Pass
2   Computer Science     32   Fail
2   Computer Science     30   Fail

In [23]:
pd.merge(df_info,df_Marks,on='ID')

     Name  Age Country           Subject  Marks Result
ID
1     Joe   23   India              Math     90   Pass
1     Joe   23   India              Math     50   Pass
1    John   19     USA              Math     90   Pass
1    John   19     USA              Math     50   Pass
2   James   38     USA  Computer Science     32   Fail
2   James   38     USA  Computer Science     30   Fail
2     Kim   15      UK  Computer Science     32   Fail
2     Kim   15      UK  Computer Science     30   Fail

In [24]:
pd.merge(df_info,df_Marks,on='ID',how='left')

     Name  Age Country           Subject  Marks Result
ID
1     Joe   23   India              Math   90.0   Pass
1     Joe   23   India              Math   50.0   Pass
1    John   19     USA              Math   90.0   Pass
1    John   19     USA              Math   50.0   Pass
2   James   38     USA  Computer Science   32.0   Fail
2   James   38     USA  Computer Science   30.0   Fail
2     Kim   15      UK  Computer Science   32.0   Fail
2     Kim   15      UK  Computer Science   30.0   Fail
3    Dani   20   India               NaN    NaN    NaN

In [25]:
pd.merge(df_info,df_Marks,on='ID',how='right')